Revit 2027 API
IIFCEntityTreeUIServer.ShowDialog Method
 Shows dialog on managing IFCEntityTreeUI.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool ShowDialog(
	IFCExternalServiceUIData data
)
Function ShowDialog (
	data As IFCExternalServiceUIData
) As Boolean
bool ShowDialog(
	IFCExternalServiceUIData^ data
)
abstract ShowDialog :
        data : IFCExternalServiceUIData -> bool
Parameters
data IFCExternalServiceUIData
 The data on initializing the dialog as well as getting the result.
Return Value
Boolean
 Whether or not the dialog launches successfully
See Also
Reference
IIFCEntityTreeUIServer Interface
Autodesk.Revit.UI Namespace